//******************************************************************************************************************************************
//******************************************************************************************************************************************
/** @file constants.h
 * @brief .
 *
 * @author Ю. Николаев
 *
 * @date 23.04.2014
 */
//******************************************************************************************************************************************


#ifndef LOGGER_CONSTANTS_H
#define LOGGER_CONSTANTS_H


#include <logger/types.h>


namespace logger
{


LOGGER_EXPORT extern const chr key_separator;       //!< Разделитель между ключами в строке.


} // namespace logger


#endif // LOGGER_CONSTANTS_H
